DataProcessors/ЛБ_ОтчетОПрибыляхИУбытках.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ЛБ_ОтчетОПрибыляхИУбытках</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНач</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКон</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЗБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументРеализации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_Реализация</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проба</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Пробы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Покупатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
						<v8:Type>cfg:CatalogRef._ДемоКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ломбард</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗалоговыйБилет</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектЗалога</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументРеализации</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЛБ_Реализация</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаРеализации</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Артикул</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проба</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_Пробы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Оценка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВесМеталла</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаЗаГрамм</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРеализации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстатокОсновнойДолгНачальный</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачисленоПроценты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОплаченоПроценты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОплаченоОсновнойДолг</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстатокПроценты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстатокОсновнойДолг</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаУбытка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыбытиеПроценты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыбытиеОсновнойДолг</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выбытие</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПрибыли</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
								<v8:Type>cfg:CatalogRef._ДемоКонтрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбщаяЗадолженность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

AccumulationRegisters/ЛБ_ПрибылиИУбыткиОтРеализации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЛБ_ПрибылиИУбыткиОтРеализации</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаРеализации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОстатокОсновнойДолгНачальный</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачисленоПроценты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыбытиеПроценты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыбытиеОсновнойДолг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОплаченоПроценты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОплаченоОсновнойДолг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОстатокПроценты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОстатокОсновнойДолг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПрибылиУбытка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектЗалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОбъектыЗалога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРеализации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_Реализация</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаРеализации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
						<v8:Type>cfg:CatalogRef._ДемоКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

DataProcessors/ЛБ_ОтчетОПрибыляхИУбытках/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	ДатаНачТекущая = Объект.ДатаНач;
	ДатаКонТекущая = Объект.ДатаКон; 
	ЗаполнитьСтрокуДокумент();
КонецПроцедуры
 
&НаКлиенте
Процедура ПечатьПрибылиУбытки(ПараметрыПечати) Экспорт
	Если Объект.Товары.Количество() = 0 Тогда  
		Предупреждение("Таблица данных для печати не заполнена.", 60);    
		Возврат;
	КонецЕсли;	
	
	ТабличныйДокумент = СформироватьПрибылиУбытки();
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТабличныйДокумент", ТабличныйДокумент);
	ОткрытьФорму("Обработка.ЛБ_ОтчетОПрибыляхИУбытках.Форма.ФормаПечати", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	//ТабличныйДокумент.Показать("Печать отчета о прибылях и убытках");
КонецПроцедуры

&НаСервере
Функция СформироватьПрибылиУбытки()
	ТабличныйДокумент = Новый ТабличныйДокумент;  
	Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.ЛБ_ОтчетОПрибыляхИУбытках.Макет");  
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");                                                                                            
	Если НЕ Объект.ДатаНач = Дата(1,1,1) И НЕ Объект.ДатаКон = Дата(1,1,1) Тогда 
	    ОбластьМакета.Параметры.Период = "за период с " + Формат(Объект.ДатаНач, "ДФ=dd.MM.yyyy") + " по " + Формат(Объект.ДатаКон, "ДФ=dd.MM.yyyy");
	ИначеЕсли НЕ Объект.ДатаНач = Дата(1,1,1) Тогда 
	    ОбластьМакета.Параметры.Период = "за период с " + Формат(Объект.ДатаНач, "ДФ=dd.MM.yyyy") + " по " + Формат(ТекущаяДатаСеанса(), "ДФ=dd.MM.yyyy"); 
	ИначеЕсли НЕ Объект.ДатаНач = Дата(1,1,1) И НЕ Объект.ДатаКон = Дата(1,1,1) Тогда 
	    ОбластьМакета.Параметры.Период = "за период по " + Формат(Объект.ДатаКон, "ДФ=dd.MM.yyyy");	
	Иначе
		ОбластьМакета.Параметры.Период = "за весь период";
	КонецЕсли;	
	СтрокаОтбор = ""; 
	Если ЗначениеЗаполнено(Объект.Ломбард) Тогда 
		СтрокаОтбор = СтрокаОтбор + ?(ПустаяСтрока(СтрокаОтбор), "", " И ") + "Ломбард = " + СокрЛП(Объект.Ломбард);   
	КонецЕсли;	 
	Если ЗначениеЗаполнено(Объект.НомерЗБ) Тогда 
		СтрокаОтбор = СтрокаОтбор + ?(ПустаяСтрока(СтрокаОтбор), "", " И ") + "№ ЗБ = " + СокрЛП(Объект.НомерЗБ);   
	КонецЕсли;	   
	Если ЗначениеЗаполнено(Объект.Артикул) Тогда 
		СтрокаОтбор = СтрокаОтбор + ?(ПустаяСтрока(СтрокаОтбор), "", " И ") + "Артикул = " + СокрЛП(Объект.Артикул);   
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.Проба) Тогда 
		СтрокаОтбор = СтрокаОтбор + ?(ПустаяСтрока(СтрокаОтбор), "", " И ") + "Проба = " + СокрЛП(Объект.Проба);   
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.Покупатель) Тогда 
		СтрокаОтбор = СтрокаОтбор + ?(ПустаяСтрока(СтрокаОтбор), "", " И ") + "Покупатель = " + СокрЛП(Объект.Покупатель);   
	КонецЕсли;	 
	Если ЗначениеЗаполнено(Объект.ДокументРеализации) Тогда 
		СтрокаОтбор = СтрокаОтбор + ?(ПустаяСтрока(СтрокаОтбор), "", " И ") + "Реализация " + СокрЛП(СтрокаДокумент);   
	КонецЕсли;	 

	ОбластьМакета.Параметры.Отборы = СтрокаОтбор;
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка"); 
	ТабличныйДокумент.Вывести(ОбластьМакета);  
	
	НомерСтроки = 3;
	НомерЗБ = "";  
	СтрНач = 0; 
	СтрКон = 0;
	Для каждого Стр Из Объект.Товары Цикл  
		НомерСтроки = НомерСтроки + 1;
		Если ПустаяСтрока(НомерЗБ) Тогда 
			НомерЗБ = Стр.ЗалоговыйБилет.НомерЗалоговогоБилета;
			СтрНач = НомерСтроки; 
			СтрКон = СтрНач;
		ИначеЕсли НЕ НомерЗБ = Стр.ЗалоговыйБилет.НомерЗалоговогоБилета Тогда 
			Если НЕ СтрНач = СтрКон Тогда 
			    ТабличныйДокумент.Область(СтрНач,5,СтрКон,5).Объединить();
				ТабличныйДокумент.Область(СтрНач,2,СтрКон,2).Объединить();
			КонецЕсли;       
			НомерЗБ = Стр.ЗалоговыйБилет.НомерЗалоговогоБилета;
			СтрНач = НомерСтроки; 
			СтрКон = СтрНач;
		Иначе
		    СтрКон = СтрКон + 1;  
		КонецЕсли;	
		ОбластьМакета = Макет.ПолучитьОбласть("Строка");  
		ОбластьМакета.Параметры.Заполнить(Стр);  
		ОбластьМакета.Параметры.Ломбард = Стр.Ломбард.НомерЛомбарда;
		ОбластьМакета.Параметры.НомерДок = Стр.ДокументРеализации.ПредставлениеНомера;
		ОбластьМакета.Параметры.НомерЗБ = Стр.ЗалоговыйБилет.НомерЗалоговогоБилета; 
		ОбластьМакета.Параметры.ОбщаяЗадолженность = Стр.ОстатокОсновнойДолгНачальный + Стр.НачисленоПроценты; 
		Если Стр.СуммаУбытка < 0 Тогда
		    ОбластьМакета.Области.Убыток.ЦветТекста = WebЦвета.Красный; 
		КонецЕсли;	 

		ТабличныйДокумент.Вывести(ОбластьМакета);
	Конеццикла;	 
	Если НЕ СтрНач = СтрКон Тогда 
	    ТабличныйДокумент.Область(СтрНач,5,СтрКон,5).Объединить();
		ТабличныйДокумент.Область(СтрНач,2,СтрКон,2).Объединить();
	КонецЕсли;    
	
	ОбластьМакета = Макет.ПолучитьОбласть("Итог");
	ОбластьМакета.Параметры.ОстатокОсновнойДолгНачальный = Объект.Товары.Итог("ОстатокОсновнойДолгНачальный"); 
	ОбластьМакета.Параметры.НачисленоПроценты = Объект.Товары.Итог("НачисленоПроценты"); 
	ОбластьМакета.Параметры.ОбщаяЗадолженность = ОбластьМакета.Параметры.ОстатокОсновнойДолгНачальный + ОбластьМакета.Параметры.НачисленоПроценты;
	ОбластьМакета.Параметры.СуммаРеализации = Объект.Товары.Итог("СуммаРеализации");
	ОбластьМакета.Параметры.ВыбытиеПроценты = Объект.Товары.Итог("ВыбытиеПроценты");
	ОбластьМакета.Параметры.ВыбытиеОсновнойДолг = Объект.Товары.Итог("ВыбытиеОсновнойДолг"); 
	ОбластьМакета.Параметры.Выбытие = Объект.Товары.Итог("ВыбытиеПроценты") + ОбластьМакета.Параметры.ВыбытиеОсновнойДолг;
	ОбластьМакета.Параметры.СуммаУбытка = Объект.Товары.Итог("СуммаУбытка"); 
	Если ОбластьМакета.Параметры.СуммаУбытка < 0 Тогда
	    ОбластьМакета.Области.ИтогУбыток.ЦветТекста = WebЦвета.Красный; 
	КонецЕсли;	
	ОбластьМакета.Параметры.Оценка = Объект.Товары.Итог("Оценка");
	ОбластьМакета.Параметры.Вес = Объект.Товары.Итог("Вес");  
	ОбластьМакета.Параметры.ВесМеталла = Объект.Товары.Итог("ВесМеталла");
	ОбластьМакета.Параметры.ОплаченоПроценты = Объект.Товары.Итог("ОплаченоПроценты");
	ОбластьМакета.Параметры.ОплаченоОсновнойДолг = Объект.Товары.Итог("ОплаченоОсновнойДолг");
	ОбластьМакета.Параметры.СуммаПрибыли = Объект.Товары.Итог("СуммаПрибыли"); 
	ОбластьМакета.Параметры.ОстатокОсновнойДолг = Объект.Товары.Итог("ОстатокОсновнойДолг");
	ОбластьМакета.Параметры.ОстатокПроценты = Объект.Товары.Итог("ОстатокПроценты");	
	ТабличныйДокумент.Вывести(ОбластьМакета);                                       
	
	ТабличныйДокумент.Защита = Истина;
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	ТабличныйДокумент.ФиксацияСверху = 3;
		
	Возврат ТабличныйДокумент;

КонецФункции

&НаКлиенте
Процедура УстановитьИнтервал(Команда)
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
    Диалог.Период = Новый СтандартныйПериод(Объект.ДатаНач, Объект.ДатаКон);
	Оповещение = Новый ОписаниеОповещения("ВыборПериодаЗавершение", ЭтаФорма);
	Диалог.Показать(Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура ВыборПериодаЗавершение(Период, ДополнительныеПараметры) Экспорт 
	Если Период = неопределено Тогда
		Возврат;
	КонецЕсли;	
	Объект.ДатаНач = Период.ДатаНачала;
    Объект.ДатаКон = Период.ДатаОкончания;
	Если НЕ Объект.ДатаКон = Дата(1,1,1) И НЕ Объект.ДатаНач = Дата(1,1,1) Тогда
		Если Объект.ДатаКон < Объект.ДатаНач Тогда 
			ДатаНач = ДатаНачТекущая;
	        ДатаКон = ДатаКонТекущая;
			Предупреждение("Конечная дата выбранного периода не может быть меньше начальной даты периода.", 60);
			Возврат;
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачПриИзменении(Элемент)  
	Если НЕ Объект.ДатаКон = Дата(1,1,1) И НЕ Объект.ДатаНач = Дата(1,1,1) Тогда 
		Если Объект.ДатаНач > Объект.ДатаКон Тогда
			Объект.ДатаНач = ДатаНачТекущая;
			Предупреждение("Начальная дата выбранного периода не может быть больше конечной даты периода.", 60); 
			Возврат;
		КонецЕсли;	
	КонецЕсли;
	ДатаНачТекущая = Объект.ДатаНач;
КонецПроцедуры

&НаКлиенте
Процедура ДатаКонПриИзменении(Элемент)  
	Если НЕ Объект.ДатаКон = Дата(1,1,1) И НЕ Объект.ДатаНач = Дата(1,1,1) Тогда 
		Если Объект.ДатаКон < Объект.ДатаНач Тогда
			Объект.ДатаКон = ДатаКонТекущая;
			Предупреждение("Конечная дата выбранного периода не может быть меньше начальной даты периода.", 60); 
			Возврат;
		КонецЕсли;	
	КонецЕсли;
	ДатаКонТекущая = Объект.ДатаКон;
КонецПроцедуры


&НаСервере
Функция ПолучитьЗаемщика(ЗБ) 
	Возврат ЗБ.Залогодатель;
КонецФункции

&НаКлиенте
Процедура ИсторияЗБ(Команда)
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	Если ТекСтрока = неопределено Тогда
		Возврат;
	КонецЕсли;	
	Если ЗначениеЗаполнено(ТекСтрока.ЗалоговыйБилет) Тогда 
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Клиент", ПолучитьЗаемщика(ТекСтрока.ЗалоговыйБилет));
		ПараметрыФормы.Вставить("ЗалоговыйБилет", ТекСтрока.ЗалоговыйБилет);	 
								
		ОткрытьФорму("Отчет.ЛБ_ИсторияЗалоговогоБилета.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);   
	КонецЕсли;	 
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаСервере()
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Дата1", Объект.ДатаНач);
	Запрос.УстановитьПараметр("Дата2", ?(Объект.ДатаКон = Дата(1,1,1), ТекущаяДатаСеанса(), КонецДня(Объект.ДатаКон)));
	Запрос.УстановитьПараметр("Ломбард", Объект.Ломбард);
	Запрос.УстановитьПараметр("НомерЗБ", Объект.НомерЗБ);
	Запрос.УстановитьПараметр("Покупатель", Объект.Покупатель);
	Запрос.УстановитьПараметр("ДокументРеализации", Объект.ДокументРеализации); 
	Запрос.УстановитьПараметр("Артикул", Объект.Артикул);
	Запрос.УстановитьПараметр("Проба", Объект.Проба);

	ОтборЗ = "";  
	Если ЗначениеЗаполнено(Объект.Ломбард) Тогда 
		ОтборЗ = ОтборЗ + ?(ПустаяСтрока(ОтборЗ), "", " И ") + "Ломбард = &Ломбард";   
	КонецЕсли;	  
	Если ЗначениеЗаполнено(Объект.НомерЗБ) Тогда 
		ОтборЗ = ОтборЗ + ?(ПустаяСтрока(ОтборЗ), "", " И ") + "ЗалоговыйБилет.НомерЗалоговогоБилета = &НомерЗБ";   
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.Покупатель) Тогда 
		ОтборЗ = ОтборЗ + ?(ПустаяСтрока(ОтборЗ), "", " И ") + "Контрагент = &Покупатель";   
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ДокументРеализации) Тогда 
		ОтборЗ = ОтборЗ + ?(ПустаяСтрока(ОтборЗ), "", " И ") + "ДокументРеализации = &ДокументРеализации";   //" + ОтборЗ + "
	КонецЕсли;	

	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ПрибылиИУбыткиОтРеализацииОбороты.Ломбард КАК Ломбард,
	               |	ЛБ_ПрибылиИУбыткиОтРеализацииОбороты.ЗалоговыйБилет КАК ЗалоговыйБилет,
	               |	ЛБ_ПрибылиИУбыткиОтРеализацииОбороты.ОбъектЗалога КАК ОбъектЗалога,
	               |	ЛБ_ПрибылиИУбыткиОтРеализацииОбороты.ДокументРеализации КАК ДокументРеализации,
	               |	ЛБ_ПрибылиИУбыткиОтРеализацииОбороты.ДатаРеализации КАК ДатаРеализации,
	               |	ЛБ_ПрибылиИУбыткиОтРеализацииОбороты.Контрагент КАК Контрагент,
	               |	ЛБ_ПрибылиИУбыткиОтРеализацииОбороты.СуммаРеализацииОборот КАК СуммаРеализации,
	               |	ЛБ_ПрибылиИУбыткиОтРеализацииОбороты.ОстатокОсновнойДолгНачальныйОборот КАК ОстатокОсновнойДолгНачальный,
	               |	ЛБ_ПрибылиИУбыткиОтРеализацииОбороты.НачисленоПроцентыОборот КАК НачисленоПроценты,
	               |	ЛБ_ПрибылиИУбыткиОтРеализацииОбороты.ВыбытиеПроцентыОборот КАК ВыбытиеПроценты,
	               |	ЛБ_ПрибылиИУбыткиОтРеализацииОбороты.ВыбытиеОсновнойДолгОборот КАК ВыбытиеОсновнойДолг,
	               |	ЛБ_ПрибылиИУбыткиОтРеализацииОбороты.ОплаченоПроцентыОборот КАК ОплаченоПроценты,
	               |	ЛБ_ПрибылиИУбыткиОтРеализацииОбороты.ОплаченоОсновнойДолгОборот КАК ОплаченоОсновнойДолг,
	               |	ЛБ_ПрибылиИУбыткиОтРеализацииОбороты.ОстатокПроцентыОборот КАК ОстатокПроценты,
	               |	ЛБ_ПрибылиИУбыткиОтРеализацииОбороты.ОстатокОсновнойДолгОборот КАК ОстатокОсновнойДолг,
	               |	ЛБ_ПрибылиИУбыткиОтРеализацииОбороты.ОстатокОсновнойДолгНачальныйОборот + ЛБ_ПрибылиИУбыткиОтРеализацииОбороты.НачисленоПроцентыОборот КАК ОбщаяЗадолженность,
	               |	ВЫБОР
	               |		КОГДА ЛБ_ПрибылиИУбыткиОтРеализацииОбороты.СуммаПрибылиУбыткаОборот >= 0
	               |			ТОГДА ЛБ_ПрибылиИУбыткиОтРеализацииОбороты.СуммаПрибылиУбыткаОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК СуммаПрибыли,
	               |	ЛБ_ПрибылиИУбыткиОтРеализацииОбороты.СуммаПрибылиУбыткаОборот КАК СуммаУбытка,
	               |	РеквизитыИзделия.Артикул КАК Артикул,
	               |	РеквизитыИзделия.Проба КАК Проба,
	               |	РеквизитыИзделия.Вес КАК Вес,
	               |	РеквизитыИзделия.СуммаОценки КАК Оценка,
	               |	РеквизитыИзделия.ВесМеталла КАК ВесМеталла,
	               |	РеквизитыИзделия.ЦенаЗаГрамм КАК ЦенаЗаГрамм,
	               |	ЛБ_ПрибылиИУбыткиОтРеализацииОбороты.ВыбытиеПроцентыОборот + ЛБ_ПрибылиИУбыткиОтРеализацииОбороты.ВыбытиеОсновнойДолгОборот КАК Выбытие
	               |ИЗ
	               |	РегистрНакопления.ЛБ_ПрибылиИУбыткиОтРеализации.Обороты(&Дата1, &Дата2, , " + ОтборЗ + ") КАК ЛБ_ПрибылиИУбыткиОтРеализацииОбороты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет,
	               |			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
	               |			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Артикул КАК Артикул,
	               |			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Проба КАК Проба,
	               |			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вес КАК Вес,
	               |			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиМакс КАК СуммаОценки,
	               |			ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.ВесЧистый КАК ВесМеталла,
	               |			ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.Цена КАК ЦенаЗаГрамм
	               |		ИЗ
	               |			РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(&Дата2, ) КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних
	               |				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_ДополнительныеМатериалыОбъектаЗалога.СрезПоследних КАК ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних
	               |				ПО ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет = ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет
	               |					И ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога = ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.ОбъектЗалога
	               |					И ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Проба = ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.Проба) КАК РеквизитыИзделия
	               |		ПО ЛБ_ПрибылиИУбыткиОтРеализацииОбороты.ЗалоговыйБилет = РеквизитыИзделия.ЗалоговыйБилет
	               |			И ЛБ_ПрибылиИУбыткиОтРеализацииОбороты.ОбъектЗалога = РеквизитыИзделия.ОбъектЗалога";
	Если ЗначениеЗаполнено(Объект.Артикул) ИЛИ ЗначениеЗаполнено(Объект.Проба) Тогда
		Запрос.Текст = Запрос.Текст + "
	               |ГДЕ";
	КонецЕсли;	  
	Если ЗначениеЗаполнено(Объект.Артикул) Тогда 
		Запрос.Текст = Запрос.Текст + "
	               |	РеквизитыИзделия.Артикул = &Артикул";
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.Проба) Тогда 
		Если ЗначениеЗаполнено(Объект.Артикул) Тогда 
			Запрос.Текст = Запрос.Текст + "
	               |	И РеквизитыИзделия.Проба = &Проба";
		Иначе   
			Запрос.Текст = Запрос.Текст + "
	               |	РеквизитыИзделия.Проба = &Проба";
		КонецЕсли;	
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Ломбард,
	               |	ЗалоговыйБилет,
	               |	ДатаРеализации,
	               |	ЛБ_ПрибылиИУбыткиОтРеализацииОбороты.Контрагент";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	Объект.Товары.Загрузить(ТаблицаЗапроса);
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьНаСервере();      
	Если НЕ Объект.Товары.Количество() = 0 Тогда
		//ЭтаФорма.ТекущийЭлемент = Элементы.Товары; 
		Элементы.Товары.ТекущаяСтрока = 0;   
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекСтрока = Элементы.Товары.ТекущиеДанные;    
	СсылкаНаДокумент = ТекСтрока.ДокументРеализации;
	ПараметрыФормы = Новый Структура;  
	ПараметрыФормы.Вставить("Ключ", СсылкаНаДокумент); 
	ПараметрыФормы.Вставить("ТолькоПросмотр", Истина);
	ОткрытьФорму("Документ.ЛБ_Реализация.ФормаОбъекта", ПараметрыФормы,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура СтрокаДокументНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;   
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораДокумента", ЭтаФорма);
	ОткрытьФорму("Документ.ЛБ_Реализация.ФормаВыбора",,ЭтаФорма,,,,ОбработкаВыбора,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры 

&НаКлиенте
Процедура ПослеВыбораДокумента(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли; 
	
	Объект.ДокументРеализации = Результат;
	ЗаполнитьСтрокуДокумент();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтрокуДокумент()
	Если ЗначениеЗаполнено(Объект.ДокументРеализации) Тогда   
		СтрокаДокумент = "№ " + СокрЛП(Объект.ДокументРеализации.ПредставлениеНомера) + " от " + Формат(Объект.ДокументРеализации.Дата, "ДЛФ=");
	Иначе                
		СтрокаДокумент = "";
	КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура СтрокаДокументОчистка(Элемент, СтандартнаяОбработка)
	Объект.ДокументРеализации = ПредопределенноеЗначение("Документ.ЛБ_Реализация.ПустаяСсылка");
	ЗаполнитьСтрокуДокумент();
КонецПроцедуры
